# 컴파일러 지정
CXX = g++

# 컴파일 옵션 설정
CXXFLAGS = -Wall -O2 -std=c++17
# -Wall: 모든 경고 메시지 출력
# -O2: 최적화 레벨 2 (성능 향상)
# -std=c++17: C++17 표준 사용

# 컴파일할 소스 파일 이름을 외부에서 지정할 수 있도록 변수로 설정(main.cpp는 항상 포함)
FILE ?= Q2557.cpp

# 최종 생성될 실행 파일 이름
TARGET = app

# 컴파일할 소스 파일(.cpp) 목록
SRCS = main.cpp .\exam_code\$(FILE)

# 문자열 치환을 이용하여 .cpp를 .o로 변경하여 목적 파일(.o) 목록 생성
OBJS = $(SRCS:.cpp=.o)

# -c 옵션 없이 바로 실행 파일(-o)로 묶어버립니다. (.o 파일이 아예 안 생김)
$(TARGET): $(SRCS)
	$(CXX) $(CXXFLAGS) $(SRCS) -o $(TARGET)

# 빌드 과정에서 생성된 파일들 삭제 규칙
clean:
	del /f /q $(OBJS) $(TARGET).exe

#=================================================================================

# 1. 최종 실행 파일 빌드 규칙
# $(TARGET): $(OBJS)
# 	$(CXX) $(CXXFLAGS) -o $@ $^

# $@는 타겟 이름 (여기서는 $(TARGET))
# $^는 모든 의존성 파일 목록 (여기서는 $(OBJS))
# g++ 컴파일러에 옵션을 줘서, 모든 .O 파일을 묶어서 최종 실행 파일($(TARGET))을 생성

# 2. 개별 목적 파일(.o) 생성 규칙
# %.o: %.cpp
# 	$(CXX) $(CXXFLAGS) -c $< -o $@

# %.o : %.cpp는 패턴 규칙 -> 어떤 이름이든 .o 파일을 만들고 싶다면, 똑같은 이름의 .cpp 파일을 재료로 써라
# -c 옵션은 컴파일만 하고 링크는 하지 말라는 의미입니다. .o 파일이 생성됩니다.
# $<는 첫 번째 의존성 파일 (여기서는 .cpp 파일)
# -o $@는 만들어질 결과물, 현재 목표 -> 생성될.o 파일 이름
